results/wrk2/jsonpost.txt
10:21:43 {play-2.6-with-netty} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R9250 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  2 threads and 50 connections
  Thread calibration: mean lat.: 2.370ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.377ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.70ms    2.18ms  38.34ms   92.86%
    Req/Sec     4.88k   619.80     9.67k    72.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.22ms
 75.000%    3.06ms
 90.000%    4.18ms
 99.000%   12.69ms
 99.900%   22.83ms
 99.990%   30.01ms
 99.999%   36.90ms
100.000%   38.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.219     0.000000            1         1.00
       1.183     0.100000        46212         1.11
       1.453     0.200000        92427         1.25
       1.699     0.300000       138495         1.43
       1.949     0.400000       184624         1.67
       2.221     0.500000       230807         2.00
       2.365     0.550000       253768         2.22
       2.515     0.600000       277036         2.50
       2.673     0.650000       299917         2.86
       2.851     0.700000       323133         3.33
       3.059     0.750000       346154         4.00
       3.181     0.775000       357708         4.44
       3.317     0.800000       369156         5.00
       3.475     0.825000       380690         5.71
       3.657     0.850000       392184         6.67
       3.877     0.875000       403740         8.00
       4.013     0.887500       409457         8.89
       4.183     0.900000       415242        10.00
       4.399     0.912500       421037        11.43
       4.703     0.925000       426739        13.33
       5.183     0.937500       432520        16.00
       5.531     0.943750       435425        17.78
       5.975     0.950000       438300        20.00
       6.519     0.956250       441166        22.86
       7.139     0.962500       444051        26.67
       7.879     0.968750       446926        32.00
       8.303     0.971875       448370        35.56
       8.767     0.975000       449819        40.00
       9.319     0.978125       451249        45.71
       9.951     0.981250       452690        53.33
      10.711     0.984375       454138        64.00
      11.167     0.985938       454861        71.11
      11.679     0.987500       455578        80.00
      12.271     0.989062       456295        91.43
      12.967     0.990625       457020       106.67
      13.767     0.992188       457739       128.00
      14.231     0.992969       458101       142.22
      14.735     0.993750       458455       160.00
      15.415     0.994531       458820       182.86
      16.167     0.995313       459178       213.33
      17.007     0.996094       459539       256.00
      17.455     0.996484       459718       284.44
      17.983     0.996875       459899       320.00
      18.559     0.997266       460080       365.71
      19.231     0.997656       460260       426.67
      20.031     0.998047       460439       512.00
      20.415     0.998242       460529       568.89
      20.943     0.998437       460618       640.00
      21.519     0.998633       460709       731.43
      22.159     0.998828       460800       853.33
      22.991     0.999023       460891      1024.00
      23.359     0.999121       460934      1137.78
      23.839     0.999219       460978      1280.00
      24.367     0.999316       461024      1462.86
      24.895     0.999414       461068      1706.67
      25.471     0.999512       461113      2048.00
      25.759     0.999561       461136      2275.56
      26.191     0.999609       461159      2560.00
      26.575     0.999658       461181      2925.71
      27.039     0.999707       461204      3413.33
      27.439     0.999756       461226      4096.00
      27.647     0.999780       461237      4551.11
      28.127     0.999805       461248      5120.00
      28.415     0.999829       461260      5851.43
      28.975     0.999854       461272      6826.67
      29.487     0.999878       461282      8192.00
      29.903     0.999890       461288      9102.22
      30.063     0.999902       461293     10240.00
      30.191     0.999915       461299     11702.86
      31.295     0.999927       461305     13653.33
      31.615     0.999939       461310     16384.00
      31.887     0.999945       461313     18204.44
      32.047     0.999951       461316     20480.00
      32.927     0.999957       461319     23405.71
      33.823     0.999963       461322     27306.67
      34.623     0.999969       461324     32768.00
      34.783     0.999973       461326     36408.89
      35.167     0.999976       461327     40960.00
      35.711     0.999979       461329     46811.43
      35.871     0.999982       461330     54613.33
      35.967     0.999985       461332     65536.00
      35.967     0.999986       461332     72817.78
      36.895     0.999988       461333     81920.00
      37.247     0.999989       461334     93622.86
      37.247     0.999991       461334    109226.67
      37.279     0.999992       461335    131072.00
      37.279     0.999993       461335    145635.56
      37.375     0.999994       461337    163840.00
      37.375     0.999995       461337    187245.71
      37.375     0.999995       461337    218453.33
      37.375     0.999996       461337    262144.00
      37.375     0.999997       461337    291271.11
      37.375     0.999997       461337    327680.00
      37.375     0.999997       461337    374491.43
      37.375     0.999998       461337    436906.67
      38.367     0.999998       461338    524288.00
      38.367     1.000000       461338          inf
#[Mean    =        2.704, StdDeviation   =        2.181]
#[Max     =       38.336, Total count    =       461338]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  554434 requests in 1.00m, 71.38MB read
Requests/sec:   9240.48
Transfer/sec:      1.19MB