results/wrk2/jsonpost.txt
02:16:47 {master} ~/Projects/com/github/plokhotnyuk/play$ wrk -c50 -d2m -t2 -R15000 -L -v -s src/test/lua/jsonPost.lua http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 2m test @ http://localhost:9000/json
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.283ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.195ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.04ms    1.90ms  47.74ms   88.85%
    Req/Sec     7.87k   741.28    10.20k    75.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.55ms
 75.000%    3.35ms
 90.000%    4.79ms
 99.000%   10.97ms
 99.900%   17.23ms
 99.990%   25.71ms
 99.999%   44.19ms
100.000%   47.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.227     0.000000            2         1.00
       1.631     0.100000       165001         1.11
       1.896     0.200000       329948         1.25
       2.093     0.300000       494778         1.43
       2.301     0.400000       660526         1.67
       2.547     0.500000       824086         2.00
       2.687     0.550000       907273         2.22
       2.833     0.600000       989471         2.50
       2.987     0.650000      1072152         2.86
       3.151     0.700000      1153842         3.33
       3.347     0.750000      1236550         4.00
       3.459     0.775000      1277813         4.44
       3.583     0.800000      1318604         5.00
       3.731     0.825000      1359986         5.71
       3.933     0.850000      1401042         6.67
       4.251     0.875000      1442350         8.00
       4.483     0.887500      1463038         8.89
       4.791     0.900000      1483564        10.00
       5.183     0.912500      1504118        11.43
       5.643     0.925000      1524643        13.33
       6.187     0.937500      1545155        16.00
       6.487     0.943750      1555473        17.78
       6.811     0.950000      1565848        20.00
       7.167     0.956250      1576134        22.86
       7.591     0.962500      1586395        26.67
       8.111     0.968750      1596639        32.00
       8.415     0.971875      1601796        35.56
       8.751     0.975000      1607021        40.00
       9.111     0.978125      1612133        45.71
       9.495     0.981250      1617285        53.33
       9.943     0.984375      1622432        64.00
      10.199     0.985938      1624985        71.11
      10.479     0.987500      1627618        80.00
      10.775     0.989062      1630185        91.43
      11.087     0.990625      1632711       106.67
      11.455     0.992188      1635308       128.00
      11.671     0.992969      1636585       142.22
      11.911     0.993750      1637887       160.00
      12.191     0.994531      1639142       182.86
      12.519     0.995313      1640417       213.33
      12.951     0.996094      1641724       256.00
      13.207     0.996484      1642357       284.44
      13.519     0.996875      1642999       320.00
      13.911     0.997266      1643646       365.71
      14.431     0.997656      1644280       426.67
      15.015     0.998047      1644924       512.00
      15.359     0.998242      1645253       568.89
      15.759     0.998437      1645568       640.00
      16.215     0.998633      1645891       731.43
      16.735     0.998828      1646216       853.33
      17.295     0.999023      1646536      1024.00
      17.663     0.999121      1646705      1137.78
      17.951     0.999219      1646855      1280.00
      18.479     0.999316      1647018      1462.86
      18.991     0.999414      1647183      1706.67
      19.647     0.999512      1647339      2048.00
      20.079     0.999561      1647418      2275.56
      20.607     0.999609      1647499      2560.00
      21.135     0.999658      1647581      2925.71
      21.743     0.999707      1647661      3413.33
      22.623     0.999756      1647740      4096.00
      23.023     0.999780      1647781      4551.11
      23.471     0.999805      1647821      5120.00
      23.983     0.999829      1647861      5851.43
      24.591     0.999854      1647903      6826.67
      25.055     0.999878      1647941      8192.00
      25.343     0.999890      1647961      9102.22
      25.839     0.999902      1647982     10240.00
      26.239     0.999915      1648002     11702.86
      27.183     0.999927      1648022     13653.33
      31.375     0.999939      1648042     16384.00
      33.791     0.999945      1648052     18204.44
      35.103     0.999951      1648063     20480.00
      35.807     0.999957      1648072     23405.71
      36.063     0.999963      1648083     27306.67
      37.695     0.999969      1648092     32768.00
      39.263     0.999973      1648097     36408.89
      39.871     0.999976      1648102     40960.00
      40.159     0.999979      1648107     46811.43
      40.351     0.999982      1648112     54613.33
      43.327     0.999985      1648117     65536.00
      43.423     0.999986      1648120     72817.78
      43.807     0.999988      1648123     81920.00
      44.095     0.999989      1648125     93622.86
      44.447     0.999991      1648127    109226.67
      45.823     0.999992      1648130    131072.00
      45.919     0.999993      1648131    145635.56
      46.079     0.999994      1648132    163840.00
      46.527     0.999995      1648134    187245.71
      46.719     0.999995      1648135    218453.33
      47.135     0.999996      1648136    262144.00
      47.263     0.999997      1648137    291271.11
      47.263     0.999997      1648137    327680.00
      47.391     0.999997      1648138    374491.43
      47.519     0.999998      1648139    436906.67
      47.519     0.999998      1648139    524288.00
      47.583     0.999998      1648141    582542.22
      47.583     0.999998      1648141    655360.00
      47.583     0.999999      1648141    748982.86
      47.583     0.999999      1648141    873813.33
      47.583     0.999999      1648141   1048576.00
      47.583     0.999999      1648141   1165084.44
      47.583     0.999999      1648141   1310720.00
      47.583     0.999999      1648141   1497965.71
      47.775     0.999999      1648142   1747626.67
      47.775     1.000000      1648142          inf
#[Mean    =        3.036, StdDeviation   =        1.898]
#[Max     =       47.744, Total count    =      1648142]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1799079 requests in 2.00m, 231.62MB read
Requests/sec:  14992.35
Transfer/sec:      1.93MB